----------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/al8xi8/Desktop/HW 6 Alexandra Chang.log
  log type:  text
 opened on:  20 Feb 2024, 00:50:43

. do "/Users/al8xi8/Desktop/HW 6 Alexandra Chang.do"

. * PBHS31001 Epidemiologic Methods HW6
. * Date: 2/20/2024 
. * By: Alexandra Chang 
. *==============================================================================*
. 
. ***************************Variable Construction********************************
. 
. *****Outcome Variable
. 
. //Step 1. Examine distribution of each observation along with missing variables.
. tab dgestat, missing

    dgestat |      Freq.     Percent        Cum.
------------+-----------------------------------
         17 |         20        0.00        0.00
         18 |         41        0.01        0.02
         19 |         69        0.02        0.03
         20 |        110        0.03        0.06
         21 |        187        0.05        0.11
         22 |        219        0.05        0.16
         23 |        277        0.07        0.23
         24 |        367        0.09        0.32
         25 |        477        0.12        0.44
         26 |        513        0.13        0.57
         27 |        583        0.14        0.71
         28 |        824        0.20        0.92
         29 |        910        0.23        1.14
         30 |      1,307        0.32        1.47
         31 |      1,778        0.44        1.91
         32 |      2,388        0.59        2.50
         33 |      3,531        0.88        3.38
         34 |      6,264        1.56        4.93
         35 |     10,324        2.56        7.50
         36 |     17,767        4.41       11.91
         37 |     34,619        8.60       20.50
         38 |     70,628       17.54       38.04
         39 |     97,974       24.33       62.37
         40 |     81,285       20.18       82.55
         41 |     39,288        9.76       92.31
         42 |     13,086        3.25       95.55
         43 |      6,896        1.71       97.27
         44 |      3,484        0.87       98.13
         45 |      1,826        0.45       98.59
         46 |        940        0.23       98.82
         47 |        580        0.14       98.96
         99 |      4,176        1.04      100.00
------------+-----------------------------------
      Total |    402,738      100.00

. //Step 2. Dichotomous variable describing yes/no of preterm using 37 weeks as cut-off.
. gen  dgestatCat=1 if dgestat<37 & dgestat~=.
(354,782 missing values generated)

. replace  dgestatCat=0 if dgestat>=37 & dgestat~=.
(354,782 real changes made)

. replace  dgestatCat=. if dgestat==99
(4,176 real changes made, 4,176 to missing)

. label variable dgestatCat "Preterm Birth"

. label define yesno 0 no 1 yes

. label values dgestatCat yesno

. drop if dgestatCat==.
(4,176 observations deleted)

. //Step 3. Tabulate to check the new variable, "dgestatCat".
. tab  dgestatCat

    Preterm |
      Birth |      Freq.     Percent        Cum.
------------+-----------------------------------
         no |    350,606       87.97       87.97
        yes |     47,956       12.03      100.00
------------+-----------------------------------
      Total |    398,562      100.00

. 
. *****Predictor Variables
. 
. *Step 1. Race
. //From natality data description: White (1); Black or African American (2); Asian/Pacific Islander (4, 5, 6, 7, 18, 28, 38, 48, 58, 68
> , 78); American Indian/Alaska Native (3).
. tab mrace

      mrace |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    314,514       78.91       78.91
          2 |     59,261       14.87       93.78
          3 |      4,181        1.05       94.83
          4 |      3,342        0.84       95.67
          5 |        903        0.23       95.89
          6 |        674        0.17       96.06
          7 |      3,224        0.81       96.87
         18 |      2,837        0.71       97.58
         28 |      1,025        0.26       97.84
         38 |        161        0.04       97.88
         48 |      1,538        0.39       98.27
         58 |         43        0.01       98.28
         68 |      2,250        0.56       98.84
         78 |      4,609        1.16      100.00
------------+-----------------------------------
      Total |    398,562      100.00

. recode mrace (1=1 "White") (2=2 "Black")  (4 5 6 7 18 28 38 48 58 68 78=3 "Asian/Pacific Islander") (3=4 "Am. Indian/Alaska Native"), 
> gen(mraceCat) 
(24,787 differences between mrace and mraceCat)

. label variable mraceCat "Maternal Racial Category"

. tab mraceCat 

Maternal Racial Category |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                   White |    314,514       78.91       78.91
                   Black |     59,261       14.87       93.78
  Asian/Pacific Islander |     20,606        5.17       98.95
Am. Indian/Alaska Native |      4,181        1.05      100.00
-------------------------+-----------------------------------
                   Total |    398,562      100.00

. //Dichotomous variable describing White/Black only.
. gen mraceCatt=1 if mraceCat==2
(339,301 missing values generated)

. replace mraceCatt=0 if mraceCat==1
(314,514 real changes made)

. recode mraceCatt (0 = 0 "White") (1 = 1 "Black"), gen(mraceCat1)
(0 differences between mraceCatt and mraceCat1)

. label variable mraceCat1 "White vs Black"

. tab mraceCat1

   White vs |
      Black |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |    314,514       84.15       84.15
      Black |     59,261       15.85      100.00
------------+-----------------------------------
      Total |    373,775      100.00

. 
. //Dichotomous variable describing Hispanic/Non-Hispanic only.
. tab ormoth

     ormoth |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    310,164       77.82       77.82
          1 |     61,003       15.31       93.13
          2 |      5,670        1.42       94.55
          3 |      1,439        0.36       94.91
          4 |     12,198        3.06       97.97
          5 |      5,166        1.30       99.27
          9 |      2,922        0.73      100.00
------------+-----------------------------------
      Total |    398,562      100.00

. recode ormoth (0=0 "NonHispanic") (1 2 3 4 5 = 1 "Hispanic"), gen(ormothCat)
(24,473 differences between ormoth and ormothCat)

. drop if ormothCat == 9 
(2,922 observations deleted)

. label variable ormothCat "Maternal Ethinicy"

. tab ormothCat

   Maternal |
   Ethinicy |      Freq.     Percent        Cum.
------------+-----------------------------------
NonHispanic |    310,164       78.40       78.40
   Hispanic |     85,476       21.60      100.00
------------+-----------------------------------
      Total |    395,640      100.00

. 
. *Step 2. Age, from "dmage"
. //keep age as continuous variable.
. tab dmage

      dmage |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |          2        0.00        0.00
         12 |         13        0.00        0.00
         13 |        134        0.03        0.04
         14 |        532        0.13        0.17
         15 |      1,823        0.46        0.63
         16 |      4,325        1.09        1.73
         17 |      7,621        1.93        3.65
         18 |     11,755        2.97        6.62
         19 |     16,647        4.21       10.83
         20 |     18,894        4.78       15.61
         21 |     19,728        4.99       20.59
         22 |     20,694        5.23       25.82
         23 |     20,393        5.15       30.98
         24 |     20,408        5.16       36.14
         25 |     20,665        5.22       41.36
         26 |     20,582        5.20       46.56
         27 |     21,131        5.34       51.90
         28 |     20,973        5.30       57.20
         29 |     21,201        5.36       62.56
         30 |     21,295        5.38       67.94
         31 |     21,097        5.33       73.28
         32 |     19,534        4.94       78.21
         33 |     16,887        4.27       82.48
         34 |     14,757        3.73       86.21
         35 |     12,793        3.23       89.45
         36 |     10,656        2.69       92.14
         37 |      8,836        2.23       94.37
         38 |      7,033        1.78       96.15
         39 |      5,346        1.35       97.50
         40 |      3,743        0.95       98.45
         41 |      2,554        0.65       99.09
         42 |      1,593        0.40       99.50
         43 |        965        0.24       99.74
         44 |        518        0.13       99.87
         45 |        252        0.06       99.93
         46 |        119        0.03       99.96
         47 |         63        0.02       99.98
         48 |         32        0.01       99.99
         49 |         24        0.01       99.99
         50 |          7        0.00      100.00
         51 |          3        0.00      100.00
         52 |          2        0.00      100.00
         53 |          7        0.00      100.00
         54 |          3        0.00      100.00
------------+-----------------------------------
      Total |    395,640      100.00

. //Recode age as categorical variable.
. *<20; 20-24 (reference category); 25-29; 30-34; 35+ (advanced maternal age).
. recode dmage (min/19=1 "<20") (20/24=2 "20-24") (25/29=3 "25-29") (30/34=4 "30-34") (35/max=5 "35+"), gen(dmageCat) 
(395,640 differences between dmage and dmageCat)

. label var dmageCat "Maternal Age Category"

. tab dmageCat

   Maternal |
        Age |
   Category |      Freq.     Percent        Cum.
------------+-----------------------------------
        <20 |     42,852       10.83       10.83
      20-24 |    100,117       25.31       36.14
      25-29 |    104,552       26.43       62.56
      30-34 |     93,570       23.65       86.21
        35+ |     54,549       13.79      100.00
------------+-----------------------------------
      Total |    395,640      100.00

. //Additional age categorical variable as 3 categories.
. recode dmage (min/19=1 "<20") (20/34=2 "20-34") (35/max=5 "35+"), gen(dmageCat3) 
(395,640 differences between dmage and dmageCat3)

. label var dmageCat3 "Maternal Age: 3 Categories"

. tab dmageCat3

   Maternal |
     Age: 3 |
 Categories |      Freq.     Percent        Cum.
------------+-----------------------------------
        <20 |     42,852       10.83       10.83
      20-34 |    298,239       75.38       86.21
        35+ |     54,549       13.79      100.00
------------+-----------------------------------
      Total |    395,640      100.00

. 
. *Step 3. Education, from "dmeduc"
. tab dmeduc

     dmeduc |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        726        0.18        0.18
          1 |        261        0.07        0.25
          2 |        603        0.15        0.40
          3 |      1,150        0.29        0.69
          4 |        960        0.24        0.94
          5 |      1,249        0.32        1.25
          6 |      9,397        2.38        3.63
          7 |      1,971        0.50        4.12
          8 |      7,008        1.77        5.90
          9 |     17,757        4.49       10.38
         10 |     18,224        4.61       14.99
         11 |     24,619        6.22       21.21
         12 |    121,306       30.66       51.87
         13 |     27,694        7.00       58.87
         14 |     42,497       10.74       69.61
         15 |     13,997        3.54       73.15
         16 |     61,730       15.60       88.75
         17 |     39,989       10.11       98.86
         99 |      4,502        1.14      100.00
------------+-----------------------------------
      Total |    395,640      100.00

. recode dmeduc (min/11=1 "<12 yrs") (12=2 "12 yrs") (13/15=3 "13-15 yrs") (16/17=4 "16+ yrs") (99=5 "missing"), gen(dmeducCat) 
(395,379 differences between dmeduc and dmeducCat)

. drop if dmeducCat==5
(4,502 observations deleted)

. label variable dmeducCat "Maternal Education Category"

. tab dmeducCat

   Maternal |
  Education |
   Category |      Freq.     Percent        Cum.
------------+-----------------------------------
    <12 yrs |     83,925       21.46       21.46
     12 yrs |    121,306       31.01       52.47
  13-15 yrs |     84,188       21.52       73.99
    16+ yrs |    101,719       26.01      100.00
------------+-----------------------------------
      Total |    391,138      100.00

. //Education as 3 categories.
. 
. *Step 4. Tobacco Use, from "tobacco"
. tab tobacco

    tobacco |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     38,793        9.92        9.92
          2 |    302,225       77.27       87.19
          9 |     50,120       12.81      100.00
------------+-----------------------------------
      Total |    391,138      100.00

. drop if tobacco==9
(50,120 observations deleted)

. recode tobacco (1=1 "yes") (2=2 "no"), gen(tobaccoCat)
(0 differences between tobacco and tobaccoCat)

. tab tobaccoCat

  RECODE of |
    tobacco |      Freq.     Percent        Cum.
------------+-----------------------------------
        yes |     38,793       11.38       11.38
         no |    302,225       88.62      100.00
------------+-----------------------------------
      Total |    341,018      100.00

. 
. *Step 5. Alcohol Use, from "alcohol"
. tab alcohol

    alcohol |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,732        0.80        0.80
          2 |    337,589       98.99       99.80
          9 |        697        0.20      100.00
------------+-----------------------------------
      Total |    341,018      100.00

. drop if alcohol==9
(697 observations deleted)

. recode alcohol (1=1 "yes") (2=2 "no"), gen(alcoholCat)
(0 differences between alcohol and alcoholCat)

. tab alcoholCat

  RECODE of |
    alcohol |      Freq.     Percent        Cum.
------------+-----------------------------------
        yes |      2,732        0.80        0.80
         no |    337,589       99.20      100.00
------------+-----------------------------------
      Total |    340,321      100.00

. 
. ***************************Variable Analysis************************************
. 
. *****Race/Ethinicy on Preterm Birth, controlling for Age and Education.
. *Exploratory analysis to choose the best Age variable.
. tabodds dgestatCat dmageCat, graph

--------------------------------------------------------------------------
  dmageCat  |      Cases     Controls       Odds      [95% conf. interval]
------------+-------------------------------------------------------------
        <20 |       5306        32223    0.16466        0.15995   0.16952
      20-24 |      10586        76745    0.13794        0.13516   0.14077
      25-29 |      10284        79750    0.12895        0.12633   0.13163
      30-34 |       9311        70696    0.13170        0.12889   0.13458
        35+ |       6219        39201    0.15864        0.15446   0.16295
--------------------------------------------------------------------------
Test of homogeneity (equal odds): chi2(4)  =   298.89
                                  Pr>chi2  =   0.0000

Score test for trend of odds:     chi2(1)  =     4.39
                                  Pr>chi2  =   0.0361

. //Continuous
. logistic dgestatCat dmage, nolog

Logistic regression                                    Number of obs = 340,321
                                                       LR chi2(1)    =    1.27
                                                       Prob > chi2   =  0.2597
Log likelihood = -126589.63                            Pseudo R2     =  0.0000

------------------------------------------------------------------------------
  dgestatCat | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       dmage |   .9990426   .0008492    -1.13   0.260     .9973796    1.000708
       _cons |   .1433547   .0033993   -81.92   0.000     .1368447    .1501745
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. est store dmage

. //Ordinal
. logistic dgestatCat dmageCat, nolog

Logistic regression                                    Number of obs = 340,321
                                                       LR chi2(1)    =    4.39
                                                       Prob > chi2   =  0.0361
Log likelihood = -126588.07                            Pseudo R2     =  0.0000

------------------------------------------------------------------------------
  dgestatCat | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    dmageCat |   .9909897   .0042791    -2.10   0.036     .9826382    .9994122
       _cons |   .1435349   .0020136  -138.37   0.000     .1396421    .1475362
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. est store dmageCat

. //Categorical, using ""20-24" as reference category.
. logistic dgestatCat ib2.dmageCat, nolog

Logistic regression                                    Number of obs = 340,321
                                                       LR chi2(4)    =  292.65
                                                       Prob > chi2   =  0.0000
Log likelihood = -126443.94                            Pseudo R2     =  0.0012

------------------------------------------------------------------------------
  dgestatCat | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    dmageCat |
        <20  |   1.193767   .0215869     9.79   0.000     1.152198    1.236835
      25-29  |   .9348665   .0137801    -4.57   0.000     .9082444    .9622688
      30-34  |    .954816   .0144502    -3.06   0.002       .92691    .9835622
        35+  |   1.150116   .0197137     8.16   0.000      1.11212     1.18941
             |
       _cons |   .1379373   .0014301  -191.07   0.000     .1351626     .140769
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. est store idmageCat

. //Estimate stats of AIC and BIC to compare.
. estimate stats dmage dmageCat idmageCat

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |          N   ll(null)  ll(model)      df        AIC        BIC
-------------+---------------------------------------------------------------
       dmage |    340,321  -126590.3  -126589.6       2   253183.3   253204.7
    dmageCat |    340,321  -126590.3  -126588.1       2   253180.1   253201.6
   idmageCat |    340,321  -126590.3  -126443.9       5   252897.9   252951.6
-----------------------------------------------------------------------------
Note: BIC uses N = number of observations. See [R] IC note.

. 
. *Repeat same steps for Education from "dmeduc".
. tabodds dgestatCat dmeducCat, graph

--------------------------------------------------------------------------
 dmeducCat  |      Cases     Controls       Odds      [95% conf. interval]
------------+-------------------------------------------------------------
    <12 yrs |       9801        59928    0.16355        0.16009   0.16708
     12 yrs |      13640        93185    0.14638        0.14377   0.14903
  13-15 yrs |       8851        65347    0.13545        0.13247   0.13849
    16+ yrs |       9414        80155    0.11745        0.11497   0.11998
--------------------------------------------------------------------------
Test of homogeneity (equal odds): chi2(3)  =   497.38
                                  Pr>chi2  =   0.0000

Score test for trend of odds:     chi2(1)  =   492.98
                                  Pr>chi2  =   0.0000

. //Continuous
. logistic dgestatCat dmeduc, nolog

Logistic regression                                    Number of obs = 340,321
                                                       LR chi2(1)    =  354.29
                                                       Prob > chi2   =  0.0000
Log likelihood = -126413.12                            Pseudo R2     =  0.0014

------------------------------------------------------------------------------
  dgestatCat | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dmeduc |   .9655027   .0017878   -18.96   0.000      .962005    .9690132
       _cons |   .2193887   .0053097   -62.68   0.000     .2092249    .2300463
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. est store dmeduc

. //Ordinal
. logistic dgestatCat dmeducCat, nolog

Logistic regression                                    Number of obs = 340,321
                                                       LR chi2(1)    =  494.09
                                                       Prob > chi2   =  0.0000
Log likelihood = -126343.22                            Pseudo R2     =  0.0020

------------------------------------------------------------------------------
  dgestatCat | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
   dmeducCat |   .8984651    .004338   -22.18   0.000     .8900028    .9070077
       _cons |   .1823681    .002354  -131.84   0.000     .1778122    .1870407
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. est store dmeducCat

. //Categorical
. logistic dgestatCat i.dmeducCat, nolog

Logistic regression                                    Number of obs = 340,321
                                                       LR chi2(3)    =  500.05
                                                       Prob > chi2   =  0.0000
Log likelihood = -126340.24                            Pseudo R2     =  0.0020

------------------------------------------------------------------------------
  dgestatCat | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
   dmeducCat |
     12 yrs  |   .8950097   .0127445    -7.79   0.000     .8703764    .9203402
  13-15 yrs  |   .8281826    .013016   -12.00   0.000     .8030607    .8540903
    16+ yrs  |   .7181298   .0110652   -21.49   0.000     .6967666     .740148
             |
       _cons |   .1635463    .001782  -166.18   0.000     .1600907    .1670764
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. est store idmeducCat

. //Estimate stats of AIC and BIC to compare.
. estimate stats dmeduc dmeducCat idmeducCat

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |          N   ll(null)  ll(model)      df        AIC        BIC
-------------+---------------------------------------------------------------
      dmeduc |    340,321  -126590.3  -126413.1       2   252830.2   252851.7
   dmeducCat |    340,321  -126590.3  -126343.2       2   252690.4   252711.9
  idmeducCat |    340,321  -126590.3  -126340.2       4   252688.5   252731.4
-----------------------------------------------------------------------------
Note: BIC uses N = number of observations. See [R] IC note.

. 
. *Logistic Regression of age, race, ethinicity, education on preterm birth.
. logistic dgestatCat ib2.dmageCat mraceCat ormothCat dmeducCat, nolog

Logistic regression                                    Number of obs = 340,321
                                                       LR chi2(7)    = 1232.11
                                                       Prob > chi2   =  0.0000
Log likelihood = -125974.21                            Pseudo R2     =  0.0049

------------------------------------------------------------------------------
  dgestatCat | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    dmageCat |
        <20  |   1.095894   .0201918     4.97   0.000     1.057025    1.136193
      25-29  |   1.011129   .0152926     0.73   0.464      .981596    1.041551
      30-34  |   1.082092    .017373     4.91   0.000     1.048572    1.116684
        35+  |   1.303843   .0234585    14.75   0.000     1.258666    1.350641
             |
    mraceCat |   1.189629   .0099438    20.77   0.000     1.170298    1.209279
   ormothCat |   .9487606   .0140534    -3.55   0.000     .9216123    .9767085
   dmeducCat |   .8835046   .0051321   -21.32   0.000     .8735029    .8936207
       _cons |   .1429124    .002987   -93.08   0.000     .1371763    .1488882
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. *****Interaction between Age and Race on Preterm Birth.
. //Controlling for education and Hispanic ethnicity
. logistic dgestatCat ib2.dmageCat3##i.mraceCat1 dmeducCat ormothCat, nolog

Logistic regression                                    Number of obs = 322,654
                                                       LR chi2(7)    = 2058.04
                                                       Prob > chi2   =  0.0000
Log likelihood = -119322.01                            Pseudo R2     =  0.0086

-------------------------------------------------------------------------------------
         dgestatCat | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          dmageCat3 |
               <20  |   1.065736   .0223144     3.04   0.002     1.022886    1.110382
               35+  |   1.256433   .0218128    13.15   0.000       1.2144    1.299921
                    |
          mraceCat1 |
             Black  |   1.662916    .026108    32.39   0.000     1.612525    1.714882
                    |
dmageCat3#mraceCat1 |
         <20#Black  |   .9251824    .032705    -2.20   0.028     .8632519    .9915559
         35+#Black  |   1.044232   .0416267     1.09   0.278      .965751    1.129091
                    |
          dmeducCat |   .9129994   .0052347   -15.88   0.000     .9027971     .923317
          ormothCat |   1.016683   .0154288     1.09   0.276     .9868883    1.047377
              _cons |   .1526858   .0026812  -107.02   0.000     .1475201    .1580324
-------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. *****Effect of Alcohol use on odds of Preterm Birth.
. //Bivariate analysis, yielding a crude estimate but run using logistic regression.
. logistic dgestatCat i.alcoholCat, nolog

Logistic regression                                    Number of obs = 340,321
                                                       LR chi2(1)    =   13.44
                                                       Prob > chi2   =  0.0002
Log likelihood = -126583.55                            Pseudo R2     =  0.0001

------------------------------------------------------------------------------
  dgestatCat | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
  alcoholCat |
         no  |   .8151926   .0443699    -3.75   0.000     .7327072    .9069639
       _cons |   .1710244   .0092652   -32.60   0.000     .1537958     .190183
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. //Checking alcohol being confounded by maternal age/race/ethinicity/education.
. logistic dgestatCat i.alcoholCat ib2.dmageCat i.mraceCat ormothCat dmeducCat , nolog

Logistic regression                                    Number of obs = 340,321
                                                       LR chi2(10)   = 2191.73
                                                       Prob > chi2   =  0.0000
Log likelihood = -125494.4                             Pseudo R2     =  0.0087

-------------------------------------------------------------------------------------------
               dgestatCat | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
--------------------------+----------------------------------------------------------------
               alcoholCat |
                      no  |   .8471974   .0463985    -3.03   0.002     .7609687     .943197
                          |
                 dmageCat |
                     <20  |   1.078266   .0199239     4.08   0.000     1.039914    1.118032
                   25-29  |   1.033856    .015676     2.20   0.028     1.003584    1.065041
                   30-34  |   1.118441   .0180231     6.95   0.000     1.083669     1.15433
                     35+  |   1.338486     .02416    16.15   0.000     1.291961    1.386687
                          |
                 mraceCat |
                   Black  |   1.659563   .0223534    37.61   0.000     1.616324    1.703958
  Asian/Pacific Islander  |   .9931635   .0279099    -0.24   0.807     .9399403    1.049401
Am. Indian/Alaska Native  |   1.129602   .0559445     2.46   0.014     1.025106    1.244749
                          |
                ormothCat |   1.018439   .0153173     1.21   0.224     .9888561    1.048907
                dmeducCat |   .9005312   .0052797   -17.87   0.000     .8902423    .9109389
                    _cons |   .1778154   .0101067   -30.38   0.000     .1590701    .1987698
-------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. //Checking alcohol being effect modified by advanced/teenage maternal age or race (black/white only)
. logistic dgestatCat i.alcoholCat##ib2.dmageCat3, nolog

Logistic regression                                    Number of obs = 340,321
                                                       LR chi2(5)    =  283.82
                                                       Prob > chi2   =  0.0000
Log likelihood = -126448.36                            Pseudo R2     =  0.0011

--------------------------------------------------------------------------------------
          dgestatCat | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
---------------------+----------------------------------------------------------------
          alcoholCat |
                 no  |   .8614338   .0590017    -2.18   0.029     .7532186    .9851964
                     |
           dmageCat3 |
                <20  |   1.377078   .2520971     1.75   0.080     .9619047    1.971448
                35+  |    1.34785   .1690596     2.38   0.017     1.054086    1.723483
                     |
alcoholCat#dmageCat3 |
             no#<20  |   .8995398   .1653109    -0.58   0.565     .6274697    1.289579
             no#35+  |   .8833042   .1115897    -0.98   0.326     .6895666    1.131474
                     |
               _cons |   .1540373   .0105078   -27.42   0.000     .1347599    .1760723
--------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. logistic dgestatCat i.alcoholCat##i.mraceCat1, nolog

Logistic regression                                    Number of obs = 322,654
                                                       LR chi2(3)    = 1580.79
                                                       Prob > chi2   =  0.0000
Log likelihood = -119560.63                            Pseudo R2     =  0.0066

--------------------------------------------------------------------------------------
          dgestatCat | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
---------------------+----------------------------------------------------------------
          alcoholCat |
                 no  |   .9187303   .0612668    -1.27   0.204     .8061661    1.047012
                     |
           mraceCat1 |
              Black  |   2.466129   .3144857     7.08   0.000     1.920741    3.166378
                     |
alcoholCat#mraceCat1 |
           no#Black  |   .6810143   .0872843    -3.00   0.003     .5297359    .8754939
                     |
               _cons |      .1376    .009137   -29.87   0.000     .1208082    .1567258
--------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. //THE END///
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
end of do-file

